In [9]:
# Create a class
class data:
    id=101 #Data,Attribute,Property,Field
    name="Abhishek"
    
    def display(s): # Methods - s is self referencing object
        print("ID=",s.id)
        print("Name=",s.name)
        
    def displaya(s,a): # Methods
        print("ID=",s.id)
        print("Name=",s.name)
        print("value of a is:",a)
    
    @staticmethod
    def sum(a,b): #static method : this kind of method is allowed but with class
        c=a+b
        return c
           
    
        
data.sum(15,17)

32

In [10]:
#pandas
import pandas as pd
s = pd.Series()
print(s)

Series([], dtype: float64)

In [14]:
S=pd.Series([10,20,30,40,50])
print (S[0])
print (S[2])
print(S.values)
print(S.index)
print(list(S.index))

10
30
[10 20 30 40 50]
RangeIndex(start=0, stop=5, step=1)
[0, 1, 2, 3, 4]

In [16]:
#The index can be specified explicitly. 
import numpy as np
data = np.array(['Ravi','Sahil','Rahul','Ankit'])
s = pd.Series(data,index=[100,101,102,103])
print(s)

100     Ravi
101    Sahil
102    Rahul
103    Ankit
dtype: object

In [17]:
s = pd.Series(['Ravi','Sahil','Rahul','Ankit'],index=[100,101,102,103])
print(s)

100     Ravi
101    Sahil
102    Rahul
103    Ankit
dtype: object

In [20]:
s = pd.Series(['Ravi','Sahil','Rahul','Ankit'],index=[100,101,102,103])
print(s[103])

Ankit

In [29]:
s = pd.Series(['Ravi','Sahil','Rahul','Ankit'],index=['a','b','c','d'])
print(s[1:])

b    Sahil
c    Rahul
d    Ankit
dtype: object

In [30]:
print(s[['a','c','d']])

a     Ravi
c    Rahul
d    Ankit
dtype: object

In [32]:
s['f']="Mohan"
print(s)

a     Ravi
b    Sahil
c    Rahul
d    Ankit
f    Mohan
dtype: object

In [34]:
new=pd.Series([8,9,10],index=['g','h','i'])
s=s.append(new)
print(s)

a     Ravi
b    Sahil
c    Rahul
d    Ankit
f    Mohan
g        8
h        9
i       10
dtype: object

In [35]:
s=s.drop(['g'])
print(s)

a     Ravi
b    Sahil
c    Rahul
d    Ankit
f    Mohan
h        9
i       10
dtype: object

In [36]:
#import the pandas library and aliasing as pd
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [37]:
import pandas as pd
data = [1,2,3,4,5]
df = pd.DataFrame(data)
print (df)

   0
0  1
1  2
2  3
3  4
4  5

In [38]:
import pandas as pd
data = [['Ravi',10],['Mohan',12],['Alok',13]]
df=pd.DataFrame(data,columns=['Name','Age'])
print(df)

    Name  Age
0   Ravi   10
1  Mohan   12
2   Alok   13

In [39]:
import pandas as pd
data = [['Ravi',10],['Mohan',12],['Alok',13]]
df=pd.DataFrame(data)
print(df)

       0   1
0   Ravi  10
1  Mohan  12
2   Alok  13

In [42]:
#Create a DataFrame from Dictionary 

import pandas as pd
d={'Item':[ 'A', 'B', 'C', 'D', 'E'],'Price':[600,756,587,859,990]}
frame1=pd.DataFrame(d)
print(frame1)
print(frame1['Item'][2]) # printing 3rd item
print(frame1['Price']) # printing values of Price column

  Item  Price
0    A    600
1    B    756
2    C    587
3    D    859
4    E    990
C
0    600
1    756
2    587
3    859
4    990
Name: Price, dtype: int64

In [44]:
#Adding rows in data frame
f2 = pd.DataFrame([['G', 500],['H',800]], columns=['Item','Price'])
frame1=frame1.append(f2)
print(frame1)

  Item  Price
0    A    600
1    B    756
2    C    587
3    D    859
4    E    990
0    G    500
0    G    500
1    H    800

In [45]:
frame1.rename(columns={'Item':'Products','Price':'Base_price'}, inplace=True)
print(frame1)

  Products  Base_price
0        A         600
1        B         756
2        C         587
3        D         859
4        E         990
0        G         500
0        G         500
1        H         800

In [47]:
# Adding a new column to an existing DataFrame object with column label by passing new series
d={'Item':[ 'A', 'B', 'C', 'D', 'E'],'Price':[600,756,587,859,990]}
frame1=pd.DataFrame(d)
frame1['Unit']=pd.Series([30,50,80,55,90])
print(frame1)

  Item  Price  Unit
0    A    600    30
1    B    756    50
2    C    587    80
3    D    859    55
4    E    990    90

In [48]:
#Adding a new column using the existing columns in Data Frame
frame1['Total_Price']=frame1['Unit']*frame1['Price']
print(frame1)

  Item  Price  Unit  Total_Price
0    A    600    30        18000
1    B    756    50        37800
2    C    587    80        46960
3    D    859    55        47245
4    E    990    90        89100

In [49]:
new_val=['NewDelhi','Mumbai','Chennai', 'Hyderabad','Lucknow']
frame1.insert(2,column='Place',value=new_val)
print(frame1)

  Item  Price      Place  Unit  Total_Price
0    A    600   NewDelhi    30        18000
1    B    756     Mumbai    50        37800
2    C    587    Chennai    80        46960
3    D    859  Hyderabad    55        47245
4    E    990    Lucknow    90        89100

In [52]:
print(frame1.loc[frame1['Item']=='A'])

  Item  Price     Place  Unit  Total_Price
0    A    600  NewDelhi    30        18000

In [51]:
print(frame1.loc[frame1['Price']>700])

  Item  Price      Place  Unit  Total_Price
1    B    756     Mumbai    50        37800
3    D    859  Hyderabad    55        47245
4    E    990    Lucknow    90        89100

In [54]:
print(frame1.loc[frame1['Item'].isin(['A','D'])])

  Item  Price      Place  Unit  Total_Price
0    A    600   NewDelhi    30        18000
3    D    859  Hyderabad    55        47245

In [59]:
print(frame1)
print(frame1.iloc[2,2])

  Item  Price      Place  Unit  Total_Price
0    A    600   NewDelhi    30        18000
1    B    756     Mumbai    50        37800
2    C    587    Chennai    80        46960
3    D    859  Hyderabad    55        47245
4    E    990    Lucknow    90        89100
Chennai

In [60]:
print(frame1)
print(frame1.iloc[:,2])

  Item  Price      Place  Unit  Total_Price
0    A    600   NewDelhi    30        18000
1    B    756     Mumbai    50        37800
2    C    587    Chennai    80        46960
3    D    859  Hyderabad    55        47245
4    E    990    Lucknow    90        89100
0     NewDelhi
1       Mumbai
2      Chennai
3    Hyderabad
4      Lucknow
Name: Place, dtype: object

In [61]:
print(frame1)
print(frame1.iloc[2,:])

  Item  Price      Place  Unit  Total_Price
0    A    600   NewDelhi    30        18000
1    B    756     Mumbai    50        37800
2    C    587    Chennai    80        46960
3    D    859  Hyderabad    55        47245
4    E    990    Lucknow    90        89100
Item                 C
Price              587
Place          Chennai
Unit                80
Total_Price      46960
Name: 2, dtype: object

In [67]:
print(frame1)
print(frame1.iloc[:4,2])

  Item  Price      Place  Unit  Total_Price
0    A    600   NewDelhi    30        18000
1    B    756     Mumbai    50        37800
2    C    587    Chennai    80        46960
3    D    859  Hyderabad    55        47245
4    E    990    Lucknow    90        89100
0     NewDelhi
1       Mumbai
2      Chennai
3    Hyderabad
Name: Place, dtype: object

In [70]:
print(frame1)
print(frame1.iloc[:,1:4])

  Item  Price      Place  Unit  Total_Price
0    A    600   NewDelhi    30        18000
1    B    756     Mumbai    50        37800
2    C    587    Chennai    80        46960
3    D    859  Hyderabad    55        47245
4    E    990    Lucknow    90        89100
   Price      Place  Unit
0    600   NewDelhi    30
1    756     Mumbai    50
2    587    Chennai    80
3    859  Hyderabad    55
4    990    Lucknow    90

In [71]:
# Drop rows with label 0
frame1.drop(0,inplace=True) #deletes first row
print(frame1)

  Item  Price      Place  Unit  Total_Price
1    B    756     Mumbai    50        37800
2    C    587    Chennai    80        46960
3    D    859  Hyderabad    55        47245
4    E    990    Lucknow    90        89100

In [74]:
df=pd.read_csv("train.csv")
print(df.head())

    Loan_ID Gender Married Dependents     Education Self_Employed  \
0  LP001002   Male      No          0      Graduate            No
1  LP001003   Male     Yes          1      Graduate            No
2  LP001005   Male     Yes          0      Graduate           Yes
3  LP001006   Male     Yes          0  Not Graduate            No
4  LP001008   Male      No          0      Graduate            No

   ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term  \
0             5849                0.0         NaN             360.0
1             4583             1508.0       128.0             360.0
2             3000                0.0        66.0             360.0
3             2583             2358.0       120.0             360.0
4             6000                0.0       141.0             360.0

   Credit_History Property_Area Loan_Status
0             1.0         Urban           Y
1             1.0         Rural           N
2             1.0         Urban           Y
3             1.0         Urban           Y
4             1.0         Urban           Y

In [75]:
a=df.columns.tolist()
print(a)

['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education', 'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount', 'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status']

In [76]:
print(df.isnull().sum())

Loan_ID               0
Gender                9
Married               3
Dependents           12
Education             0
Self_Employed        27
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           18
Loan_Amount_Term     14
Credit_History       41
Property_Area         0
Loan_Status           0
dtype: int64

In [77]:
print(df['Gender'].isnull().sum())

9

In [81]:
m=df['LoanAmount'].mean()
print(m)
df['LoanAmount'].fillna(m, inplace=True)

144.02074688796682

In [80]:
print(df.isnull().sum())

Loan_ID               0
Gender                9
Married               3
Dependents           12
Education             0
Self_Employed        27
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term     14
Credit_History       41
Property_Area         0
Loan_Status           0
dtype: int64

In [82]:
m=df['LoanAmount'].min()
print(m)

17.0

In [83]:
m=df['LoanAmount'].max()
print(m)

700.0

In [84]:
df.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,500.000000,500.000000,500.000000,486.000000,459.000000
mean,5493.644000,1506.307840,144.020747,342.543210,0.843137
std,6515.668972,2134.432188,80.846099,63.834977,0.364068
min,150.000000,0.000000,17.000000,12.000000,0.000000
25%,2874.500000,0.000000,100.000000,360.000000,1.000000
50%,3854.000000,1125.500000,128.000000,360.000000,1.000000
75%,5764.000000,2253.250000,160.000000,360.000000,1.000000
max,81000.000000,20000.000000,700.000000,480.000000,1.000000

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 13 columns):
Loan_ID              500 non-null object
Gender               491 non-null object
Married              497 non-null object
Dependents           488 non-null object
Education            500 non-null object
Self_Employed        473 non-null object
ApplicantIncome      500 non-null int64
CoapplicantIncome    500 non-null float64
LoanAmount           500 non-null float64
Loan_Amount_Term     486 non-null float64
Credit_History       459 non-null float64
Property_Area        500 non-null object
Loan_Status          500 non-null object
dtypes: float64(4), int64(1), object(8)
memory usage: 50.9+ KB